examples/eulerian_module_examples/E6_LES_simulation/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  | Author: 2023, by Flavio A. C. Martins f.m.martins@tudelft.nl
\*---------------------------------------------------------------------------*/



FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "./meshing/sphere_in_domain.stl"

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

minCellSize         0.05; 
maxCellSize         0.1;
boundaryCellSize    0.1;

// Stop meshing when it is not possible to capture all geometric features
enforceGeometryConstraints 1;


// Add refinement regions:
objectRefinements
{
    sphereRefinement
    {
        type sphere;
        centre (0 0 0);  // Center of the sphere
        radius 1.3;       // Radius of refinement zone
        cellSize 0.06;
    }
}


// Add boundary layers:
boundaryLayers
{
    patchBoundaryLayers
    {
        "sphere"
        {
            nLayers 6;
            thicknessRatio 1.2;
            maxFirstLayerThickness 0.05;
            allowDiscontinuity 1;
        }
    }
}




renameBoundary
{
    defaultType     patch;

    newPatchNames
    {
        "xMin|yMin|yMax|zMin|zMax" 
        { 
            newName numericalBoundary; 
            type  patch; 
        }

        "xMax" 
        { 
            newName outlet; 
            type  patch; 
        }

        "sphere" 
        { 
            newName wall; 
            type  wall; 
        }
        
    }
}




// ************************************************************************* //