examples/eulerian_module_examples/E6_LES_simulation/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   #include "internalFieldU";

boundaryField
{
    numericalBoundary
    {
        type            fixedValue;
        value           #include "boundaryFieldU";
        inletValue      #include "boundaryFieldU";
    }

    outlet
    {
        type 			zeroGradient;
    }

    wall
    {
        type            noSlip;
    }

}

// ************************************************************************* //
