examples/eulerian_module_examples/E6_LES_simulation/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   #include "internalFieldP";

boundaryField
{
    numericalBoundary
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type        fixedValue;
		value       uniform 0;
    }

    wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
