examples/eulerian_module_examples/E6_LES_simulation/0.orig/boundaryFieldU
uniform (25.75 3.62 0);