examples/eulerian_module_examples/E6_LES_simulation/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.14;

boundaryField
{
    numericalBoundary
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            nutUWallFunction;
        value           uniform 0;
    }

}

// ************************************************************************* //
